# -*- coding: utf-8 -*-
import random , time , sys


#===============================初期化===============================

win = 0
lose = 0
t_win = 0
t_lose = 0
aiko = 0

#===============================ゲーム処理ループ===============================

while True:

#===============================出し手入力===============================

    print(u"""何を出しますか？
グー: 1    チョキ: 2    パー:3""")
    man = input(">>> ")

#===============================cpu乱数===============================

    cpu = random.randint(1,3)

#===============================掛け声=============================

    if aiko == 1:
        print(u"""
あいこでしょ！
        """)
        aiko=0
    else:
        print("""
じゃんけんぽん！
        """)

#===============================じゃんけん表示===============================

    if man == "1":
        print(u"    あなた    :グー")
    elif man == "2":
        print(u"    あなた    :チョキ")
    elif man == "3":
        print(u"    あなた    :パー")
    else:
        print(u"グーチョパーとか甘え")         #1～3以外はもう一度
        continue

    if cpu == 1:                               #見やすくするのに改行を設ける
        print(u"""コンピューター:グー
        """)
    elif cpu == 2:
        print(u"""コンピューター:チョキ
        """)
    else:
        print(u"""コンピューター:パー
        """)

#===============================勝敗判定===============================

    if man == "1":                              # man = グー
        if cpu == 1:                          # CPU = 1: グー    2: チョキ    3: パー
            aiko = 1
        elif cpu == 2:
            win = 1
        else:
            lose = 1

    elif man == "2":                            #man = チョキ
        if cpu == 1:
            lose = 1
        elif cpu == 2:
            aiko = 1
        else:
            win = 1

    else:                                     #man = パー
        if cpu == 1:
            win = 1
        elif cpu == 2:
            lose = 1
        else:
            aiko = 1

#===============================結果発表===============================

    if win == 1:
        print(u"""やったね！
        """)
    elif lose == 1:
        print(u"""ずこー
        """)
    else:
        print(u"""あいこだよ
        """)
        continue

#===============================トータル判定===============================

    if win == 1:                             #勝敗加算後、勝敗フラグリセット
        t_win += 1
        win = 0
    else:
        t_lose += 1
        lose = 0

    if t_win == 3:                           #3勝もしくは3敗で1セット終了
        print(u"おめでとう！")
    elif t_lose == 3:
        print(u"残念！")
    else:
        print(u"勝ち" + str(t_win) + "負け" + str(t_lose))
        print(" ")
        continue
    t_win = 0                                #勝敗決したのでカウンターリセット
    t_lose = 0

#===============================終了判定===============================

    print(u"""まだ続ける？
はい: 1    いいえ: 2""")
    onemore = input(">>> ")
    if onemore == "1":
        continue
    elif onemore == "2":
        print(u"またやろうね！")
        sys.exit()
    else:
        print(u"相手は何も言わず去って行った")
        sys.exit()
