# To change this license header, choose License Headers in Project Properties.
# To change this template file, choose Tools | Templates
# and open the template in the editor.

__author__ = "user"
__date__ = "$2017/02/23 12:46:08$"

#import wiringpi as GPIO
import time


#-----GPIOの初期設定----


#OUT = 26       #左側19

#GPIO.wiringPiSetupGpio()
#GPIO.pinMode(OUT,GPIO.OUTPUT)


#-----実行部分-----


if __name__ == "__main__":


    #-----発信信号の時間の辞書


    #キーは文字で値は長さ
    #線は点の3倍
    dic ={
    '0':[3,3,3,3,3],
    '1':[1,3,3,3,3],
    '2':[1,1,3,3,3],
    '3':[1,1,1,3,3],
    '4':[1,1,1,1,3],
    '5':[1,1,1,1,1],
    '6':[3,1,1,1,1],
    '7':[3,3,1,1,1],
    '8':[3,3,3,1,1],
    '9':[3,3,3,3,1],

    'a':[1,3],
    'b':[3,1,1,1],
    'c':[3,1,3,1],
    'd':[3,1,1],
    'e':[1],
    'f':[1,1,3,1],
    'g':[3,3,1],
    'h':[1,1,1,1,],
    'i':[1,1],
    'j':[1,3,3,3],
    'k':[3,1,3],
    'l':[1,3,1,1],
    'm':[3,3],
    'n':[3,1],
    'o':[3,3,3],
    'p':[1,3,3,1],
    'q':[3,3,1,3],
    'r':[1,3,1],
    's':[1,1,1],
    't':[3],
    'u':[1,1,3],
    'v':[1,1,1,3],
    'w':[1,3,3],
    'x':[3,1,1,3],
    'y':[3,1,3,3],
    'z':[3,3,1,1],

    'あ':[3,3,1,3,3],
    'い':[1,3],
    'う':[1,1,3],
    'え':[3,1,3,3,3],
    'お':[1,3,1,1,1],
    'か':[1,3,1,1],
    'き':[3,1,3,1,1],
    'く':[1,1,1,3],
    'け':[3,1,3,3],
    'こ':[3,3,3,3],
    'さ':[3,1,3,1,3],
    'し':[3,3,1,3,1],
    'す':[3,3,3,1,3],
    'せ':[1,3,3,3,1],
    'そ':[3,3,3,1],
    'た':[3,1],
    'ち':[1,1,3,1],
    'つ':[1,3,3,1],
    'て':[1,3,1,3,3],
    'と':[1,1,3,1,1],
    'な':[1,3,1],
    'に':[3,1,3,1],
    'ぬ':[1,1,1,1],
    'ね':[3,3,1,3,],
    'の':[1,1,3,3],
    'は':[3,1,1,1],
    'ひ':[3,3,1,1,3],
    'ふ':[3,3,1,1],
    'へ':[1],
    'ほ':[3,1,1],
    'ま':[3,1,1,3],
    'み':[1,1,3,1,3],
    'む':[3],
    'め':[3,1,1,1,3],
    'も':[3,1,1,3,1],
    'や':[1,3,3],
    'ゆ':[3,1,1,3,3],
    'よ':[3,3],
    'ら':[1,1,1],
    'り':[3,3,1],
    'る':[3,1,3,3,1],
    'れ':[3,3,3],
    'ろ':[1,3,1,3],
    'わ':[3,1,3],
    'を':[1,3,3,3],
    'ん':[1,3,1,3,1],
    'が':[1,3,1,1,1,1],
    'ぎ':[3,1,3,1,1,1,1],
    'ぐ':[1,1,1,3,1,1],
    'げ':[3,1,3,3,1,1],
    'ご':[3,3,3,3,1,1],
    'ざ':[3,1,3,1,3,1,1],
    'じ':[3,3,1,3,1,1,1],
    'ず':[3,3,3,1,3,1,1],
    'ぜ':[1,3,3,3,1,1,1],
    'ぞ':[3,3,3,1,1,1],
    'だ':[3,1,1,1],
    'ぢ':[1,1,3,1,1,1],
    'づ':[1,3,3,1,1,1],
    'で':[1,3,1,3,3,1,1],
    'ど':[1,1,3,1,1,1,1],
    'ば':[3,1,1,1,1,1],
    'び':[3,3,1,1,3,1,1],
    'ぶ':[3,3,1,1,1,1],
    'べ':[1,1,1],
    'ぼ':[3,1,1,1,1],
    'ぱ':[3,1,1,1,1,1,3,3,1],
    'ぴ':[3,3,1,1,3,1,1,3,3,1],
    'ぷ':[3,3,1,1,1,1,3,3,1],
    'ぺ':[1,1,3,3,1],
    'ぽ':[3,1,1,1,1,3,3,1],
    'ー':[1,3,3,1,3]}


#-----初期化-----
    sign = []

    #-----入力-----


    while True:
        str = input(u'発信したい文字を半角英数、ひらがなで入れてください >> ').lower()
        strlist = list(str)
        stccount = len(strlist)

        #strlistの中身を一つづつ文字の検索して一致してればokをcountの中に入れる
        #すべてを検索し終えた後にstrlistとcountの要素数が同じなら前一致なのでループを抜ける
        count = ['ok' for match in strlist
            if  u'ぁ' <= match <= u'ん'
            or   'a'  <= match <= 'z'
            or   '1'  <= match <= '9'
            or   match == 'ー' ]
        if len(count) == len(strlist):
            break
        else:
            print(u'入力された文字が不適切です。もう一度入力してください')
            continue


    #-----発信信号作成-----


    for word in strlist:
        sign += dic[word]
        #デバッグ用
        #print(sign)


    #-----発信------


    for long in sign:
        #デバッグ用
        print(long)
#        GPIO.digitalWrite(OUT,GPIO.HIGH)
#        time.sleep(long / 5)
#        GPIO.digitalWrite(OUT,GPIO.LO
         #符号間の間は１点と同じ間隔
#        time.sleep(1 / 0.5)